In [3]:
import pandas as pd

person = pd.DataFrame({'personId' : [1, 2], 
                       'lastName' : ["Wang", "Alice"],
                       'firstName' : ["Allen", "Bob"]}
                      )
person

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

In [4]:
address = pd.DataFrame({'addressId' : [1, 2], 'personId' : [2, 3], 
                       'city' : ["New York City", "Leetcode"],
                       'state' : ["New York", "California"]})
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [5]:
pd.concat([person, address])

   personId lastName firstName  addressId           city       state
0         1     Wang     Allen        NaN            NaN         NaN
1         2    Alice       Bob        NaN            NaN         NaN
0         2      NaN       NaN        1.0  New York City    New York
1         3      NaN       NaN        2.0       Leetcode  California

In [6]:
person.merge(address )

   personId lastName firstName  addressId           city     state
0         2    Alice       Bob          1  New York City  New York

In [7]:
result = pd.merge(person, address, on='personId', how='left')
result.drop(['addressId', 'personId'], axis=1, inplace=True)
result['lastName'], result['firstName'] =  result['firstName'], result['lastName']
result

  lastName firstName           city     state
0    Allen      Wang            NaN       NaN
1      Bob     Alice  New York City  New York

In [8]:
employee = pd.DataFrame({ 'id' : [1, 2, 3, 4],
                         'name' : ['Joe', 'Henry', 'Sam', 'Max'],
                         'salary' : [7000, 8000, 6000, 9000],
                         'managerId' : [3, 4, None, None]
    
})

#employee.set_index('id', inplace=True)

#for i in range(len(employee)) :
#   if pd.isna(employee.iloc[i, 2]):
#        employee.iloc[i, 2] = i+1
        
employee

   id   name  salary  managerId
0   1    Joe    7000        3.0
1   2  Henry    8000        4.0
2   3    Sam    6000        NaN
3   4    Max    9000        NaN

In [9]:
result = pd.merge(left=employee, right=employee, suffixes=['_l', '_r'], left_on='managerId', right_on='id')

names = result[result.salary_l > result.salary_r]['name_l']

pd.DataFrame(names)

  name_l
0    Joe

In [10]:
person = pd.DataFrame({ 'id' : [1, 2, 3, 4],
                       'email' : ['a', 'b', 'a', 'b']
    
})


results = pd.DataFrame()

results = person.loc[person.duplicated(subset=['email']), ['email']]


print(results.drop_duplicates())

  email
2     a
3     b

In [11]:
person = pd.DataFrame({ 'id' : [1, 2, 3, 4],
                       'email' : ['a', 'b', 'a', 'b']
    
})

temp = person.groupby('email').email.count()

temp = temp[temp > 1]

arr = temp.index

print(type(arr))

result = pd.Series(arr, name = 'Email')

result

<class 'pandas.core.indexes.base.Index'>

0    a
1    b
Name: Email, dtype: object

In [14]:
person = pd.DataFrame({ 'id' : [1, 2, 3],
                       'email' : [1 , 2 , 3 ]
    
})

person2 = pd.DataFrame({ 'id' : [3, 2, 1, 4],
                       'email' : [1, 2 , 1 , 2]
})

temp = person2.groupby('email').count()
temp = pd.DataFrame({'Id' : temp.index})
print(temp)



temp = pd.merge(person , temp, left_on = 'id', right_on = 'Id', how = 'left')

temp = temp.isna()


print(temp)

   Id
0   1
1   2
      id  email     Id
0  False  False  False
1  False  False  False
2  False  False   True

In [15]:
person2.sort_values('id')

person2.drop_duplicates('email', inplace=True, )

person2

   id  email
0   3      1
1   2      2

In [25]:

# Create the 'Weather' DataFrame
weather_data = {'id': [1, 2, 3, 4],
                'recordDate': ['2015-01-01', '2015-01-02', '2015-01-03', '2015-01-04'],
                'temperature': [10, 25, 20, 30]}
Weather = pd.DataFrame(weather_data)

# Create the 'Temp' DataFrame
temp_data = {'id': [1, 2, 3, 4],
             'recordDate': ['2015-01-02', '2015-01-03', '2015-01-04', '2015-01-05'],
             'temperature': [10, 25, 20, 30]}
Temp = pd.DataFrame(temp_data)

# Perform an inner join to select rows with matching 'recordDate'
result = Weather.merge(Temp, on='recordDate')

# 'result' now contains rows where 'recordDate' matches in both DataFrames
result[result['temperature_x'] > result['temperature_y']] [['id_x']]

   id_x
0     2
2     4

In [44]:
data = {
    'player_id': [1, 1, 2, 3, 3],
    'device_id': [2, 2, 3, 1, 4],
    'event_date': ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5, 6, 1, 0, 5]
}

activity = pd.DataFrame(data)
df = activity.groupby('player_id').apply(lambda group: group[['event_date']].min())
df.reset_index(inplace=True)
df

   player_id  event_date
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

In [48]:
# Sample DataFrame
data = {
    'ID': [1, 2, 3, 4, 5],
    'Value': [None, 750, 1200, None, 500],
}

df = pd.DataFrame(data)
print(df.empty)
# Select rows with NaN or Value < 1000
selected_rows = df[df['Value'].isna() | (df['Value'] < 1000)]

False